artillery/teams/queries/teams.yml
config:
  target: 'https://lemonade.leersteun.lars-tst.school'
  processor: "../../utils/response-logger.js"
  phases:
    - duration: 1
      arrivalRate: 1
      name: "Simple load test - teams"
  variables:
    # access_token: "{{ $processEnvironment.ACCESS_TOKEN || 'your-access-token-here' }}"
    # mongo_claims: "{{ $processEnvironment.MONGO_CLAIMS || 'your-mongo-claims-here' }}"
    access_token: "eyJ0eXAiOiJKV1QiLCJhbGciOiJSUzI1NiIsImtpZCI6IkpZaEFjVFBNWl9MWDZEQmxPV1E3SG4wTmVYRSJ9.eyJhdWQiOiJlNDgzNmE5OC03OGRhLTQ3MGYtYmZmNS00MjE2N2U0OWRiNTgiLCJpc3MiOiJodHRwczovL2xvZ2luLm1pY3Jvc29mdG9ubGluZS5jb20vNDEyNmFiYTktNjIyZC00YWRhLTk4YzMtMmViMzE5NzkzZWM2L3YyLjAiLCJpYXQiOjE3NTQ0MzE3MTksIm5iZiI6MTc1NDQzMTcxOSwiZXhwIjoxNzU0NTE0ODE5LCJhaW8iOiJBWVFBZS84WkFBQUFPL2xTM05ubCswVXA3ZHhWbEkyQ0RJNWRHeFVIcUx3MGg1WXI0bU04U2o0OHkzY05pYUQ0YjlLeVAyWmVCY1VITUtVMlpXN0VYRE84QjFFcEx1UTMxSGNGMXVtaE42clZ4S1RSd3BXWmlmcXBYSWhDd3doVmVPODZ0VnZpemlIQk1ZVTVmbU44bWlWekM4TElsVEV6ZDlubmpnVktZT1JaYWh2TlF6TEpOeVE9IiwiZW1haWwiOiJQaWV0ZXIuQnJhYmFudEB0ZHN2Zi5vbm1pY3Jvc29mdC5jb20iLCJuYW1lIjoiUGlldGVyIEJyYWJhbnQiLCJvaWQiOiIzMmNmZDQwZS04NjhkLTQyMGQtYmUwZC04NTA5MTliNWFhYWEiLCJwcmVmZXJyZWRfdXNlcm5hbWUiOiJQaWV0ZXIuQnJhYmFudEB0ZHN2Zi5vbm1pY3Jvc29mdC5jb20iLCJyaCI6IjEuQWE4QXFhc21RUzFpMmtxWXd5NnpHWGsteHBocWctVGFlQTlIdl9WQ0ZuNUoyMWhLQWNLdkFBLiIsInNpZCI6IjAwNWYxN2Q5LWQyNDgtYTY0ZC1iZjU0LTU3YzVjZjM0MTRiZSIsInN1YiI6IkNwMnZRSnFKUnBsQkFjTFhGM09yVUxFZUM1dS1ocEFYTlVRSHRWSXNsLXMiLCJ0aWQiOiI0MTI2YWJhOS02MjJkLTRhZGEtOThjMy0yZWIzMTk3OTNlYzYiLCJ1dGkiOiJGZkhjY2RLU0NFYWE1TlJuNTRPQ0FBIiwidmVyIjoiMi4wIn0.Pg_fYs4jJv5wjSRJ2NuoM21jM5ps7nsHPsOKbmzDdFrmAilRq8mX23hewMrLXIOp3Jblf-EEE9DP860u6qdR8tyN0X9NO17g8bbw0SXzU-UY8uFPDfnoGFdYGYa3S_ADP8-BbtegOihimX51NGVqAY1nGQJSv-fh8SHf8UwmwT2pc7y9w4QbD28WqBLHQAFqDmNF2LaIxDIoq4pHRfe_xc0mPkhUKCxe3239QD0Ug_zDkcsNmb0XdJdNSxciVTrfll7TorXEOWOKHN4rChoyxo_mgjjj-Ey9HN3nLOVypa4Jm7U3PQskrmMk0bTUCMtTGUlEQ0UBZbBeEKC4Gvz7wA"
    mongo_claims: "eyJhbGciOiJSUzI1NiIsInR5cCI6IkpXVCJ9.eyJzdWIiOiJDcDJ2UUpxSlJwbEJBY0xYRjNPclVMRWVDNXUtaHBBWE5VUUh0VklzbC1zIiwidmVyIjoiMi4wIiwiYWlvIjoiQVlRQWUvOFpBQUFBTy9sUzNObmwrMFVwN2R4VmxJMkNESTVkR3hVSHFMdzBoNVlyNG1NOFNqNDh5M2NOaWFENGI5S3lQMlplQmNVSE1LVTJaVzdFWERPOEIxRXBMdVEzMUhjRjF1bWhONnJWeEtUUndwV1ppZnFwWEloQ3d3aFZlTzg2dFZ2aXppSEJNWVU1Zm1OOG1pVnpDOExJbFRFemQ5bm5qZ1ZLWU9SWmFodk5RekxKTnlRPSIsInJvbGVzIjpbIkxTQy00MTI2YWJhOS02MjJkLTRhZGEtOThjMy0yZWIzMTk3OTNlYzYiLCJMU0MtNDcwMzVkMTktMGRiZS00N2NjLWEwZjMtNGU0MjlhZDFjZTc4IiwiQ3AydlFKcUpScGxCQWNMWEYzT3JVTEVlQzV1LWhwQVhOVVFIdFZJc2wtcyJdLCJpc3MiOiJodHRwczovL2xvZ2luLm1pY3Jvc29mdG9ubGluZS5jb20vNDEyNmFiYTktNjIyZC00YWRhLTk4YzMtMmViMzE5NzkzZWM2L3YyLjAiLCJidXNpbmVzc1JvbGVzIjpbIkNPT1JESU5BVE9SIiwiQURNSU4iXSwidXRpIjoiRmZIY2NkS1NDRWFhNU5SbjU0T0NBQSIsInByZWZlcnJlZF91c2VybmFtZSI6IlBpZXRlci5CcmFiYW50QHRkc3ZmLm9ubWljcm9zb2Z0LmNvbSIsIm9pZCI6IjMyY2ZkNDBlLTg2OGQtNDIwZC1iZTBkLTg1MDkxOWI1YWFhYSIsInZlcnNpb24iOiIxLjMuNCIsInRpZCI6IjQxMjZhYmE5LTYyMmQtNGFkYS05OGMzLTJlYjMxOTc5M2VjNiIsInNpZCI6IjAwNWYxN2Q5LWQyNDgtYTY0ZC1iZjU0LTU3YzVjZjM0MTRiZSIsImF1ZCI6ImU0ODM2YTk4LTc4ZGEtNDcwZi1iZmY1LTQyMTY3ZTQ5ZGI1OCIsIm5iZiI6MTc1NDQzMTcxOSwiaWRwIjoibGVtb25hZGUiLCJyaCI6IjEuQWE4QXFhc21RUzFpMmtxWXd5NnpHWGsteHBocWctVGFlQTlIdl9WQ0ZuNUoyMWhLQWNLdkFBLiIsIm5hbWUiOiJQaWV0ZXIgQnJhYmFudCIsIl9pZCI6IjAwNzgyMmU3LTdiZWYtNGQ1Ni1iYzAzLTk4MzRmNDI4NmRiYSIsImV4cCI6MTc1NDUxNDgyNCwiaWF0IjoxNzU0NDMyMDIxLCJlbWFpbCI6IlBpZXRlci5CcmFiYW50QHRkc3ZmLm9ubWljcm9zb2Z0LmNvbSJ9.aY2UyvtHbFMjf7sRiq0QXir1JzwippE-OTsptYPq36O2wxJyaa-VZKCNaiLEwR5x7o09TTF9M1OXEfa-JI2tdFERgRE17tmwDyg9A0LTbpogs1WfOBAnJV0ZgER2OeLY4JQN1Szb_q_a1vcdKZk5v-fOPGLdwNnfPs8Q3RS_i1Ql3LtdgCxeHnc0AJYVRR6Px2TunN_ut09IbVXXNCxd5yQkR_4SaeFs5PbBmqyPYRu7RpLQNov_cE64YY1FdrYMAqxnqZK1ixWW4ugcGBNUqRfyPqd3LKvp7z1u7v_6k2ep-CHWsY9CJIo1UH1KXyCc0u4f4EZS6oeIpWYHb7Dvjg"

scenarios:
  - name: "Teams list Query"
    weight: 100
    flow:
      - loop:
        - post:
            url: "/api/zorglink/zorglink-team"
            headers:
              Content-Type: "application/json"
              Cookie: "access_token={{ access_token }}; mongo_claims={{ mongo_claims }}"
            json:
              - $match:
                  learningSupportCenterId: "4126aba9-622d-4ada-98c3-2eb319793ec6"
              - $sort:
                  name: 1
            afterResponse: "logResponse"
            expect:
              - statusCode: 200
        count: 1