artillery/teams/queries/teams.yml
config:
  target: 'https://lemonade.leersteun.lars-tst.school'
  processor: "../../utils/response-logger.js"
  phases:
    - duration: 1
      arrivalRate: 1
      name: "Simple load test - teams"
  variables:
    access_token: "{{ $env.ACCESS_TOKEN }}"
    mongo_claims: "{{ $env.MONGO_CLAIMS }}"

scenarios:
  - name: "Teams list Query"
    weight: 100
    flow:
      - loop:
        - post:
            url: "/api/zorglink/zorglink-team"
            headers:
              Content-Type: "application/json"
              Cookie: "access_token={{ access_token }}; mongo_claims={{ mongo_claims }}"
            json:
              - $match:
                  learningSupportCenterId: "4126aba9-622d-4ada-98c3-2eb319793ec6"
              - $sort:
                  name: 1
            afterResponse: "logErrorResponse"
            expect:
              - statusCode: 200
        count: 1